Управление_торговлей_демо/src/Enums/ШаблоныКодовМаркировкиСУЗ/ШаблоныКодовМаркировкиСУЗ.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:Enum>
  <name>ШаблоныКодовМаркировкиСУЗ</name>
  <enumValues>
    <name>Обувь</name>
  </enumValues>
  <enumValues>
    <name>БлокТабачныхПачек</name>
  </enumValues>
  <enumValues>
    <name>ТабачнаяПачка</name>
  </enumValues>
  <enumValues>
    <name>ЛегкаяПромышленность</name>
  </enumValues>
  <enumValues>
    <name>МолочнаяПродукцияПодконтрольнаяВЕТИС</name>
  </enumValues>
  <enumValues>
    <name>СкоропортящаясяМолочнаяПродукцияВЕТИС</name>
  </enumValues>
  <enumValues>
    <name>МолочнаяПродукцияБезУказанияСроковГодностиВЕТИС</name>
  </enumValues>
  <enumValues>
    <name>Шины</name>
  </enumValues>
  <enumValues>
    <name>Фотоаппараты</name>
  </enumValues>
  <enumValues>
    <name>Духи</name>
  </enumValues>
  <enumValues>
    <name>Велосипеды</name>
  </enumValues>
  <enumValues>
    <name>КреслаКоляски</name>
  </enumValues>
  <enumValues>
    <name>ДухиКомплект</name>
  </enumValues>
  <enumValues>
    <name>ЛегкаяПромышленностьКомплект</name>
  </enumValues>
  <enumValues>
    <name>ФотоаппаратыКомплект</name>
  </enumValues>
  <enumValues>
    <name>АльтернативныйТабакБлок</name>
  </enumValues>
  <enumValues>
    <name>АльтернативныйТабакПачка</name>
  </enumValues>
  <enumValues>
    <name>АльтернативныйТабакПачкаGS1</name>
  </enumValues>
  <enumValues>
    <name>УпакованнаяВода</name>
  </enumValues>
  <enumValues>
    <name>МолочнаяПродукцияБезВЕТИС</name>
  </enumValues>
  <enumValues>
    <name>МолочнаяПродукцияСерия6СимволовВЕТИС</name>
  </enumValues>
  <enumValues>
    <name>МолочнаяПродукцияСерия6СимволовБезВЕТИС</name>
  </enumValues>
  <enumValues>
    <name>Антисептики</name>
  </enumValues>
  <enumValues>
    <name>БАДы</name>
  </enumValues>
  <enumValues>
    <name>Пиво</name>
  </enumValues>
  <enumValues>
    <name>НикотиносодержащаяПродукцияПачка</name>
  </enumValues>
  <enumValues>
    <name>НикотиносодержащаяПродукцияБлок</name>
  </enumValues>
  <enumValues>
    <name>ПродукцияИзНатуральногоМеха</name>
  </enumValues>
  <enumValues>
    <name>НикотиносодержащаяПродукцияНабор</name>
  </enumValues>
  <enumValues>
    <name>ДухиНабор</name>
  </enumValues>
  <enumValues>
    <name>ЛегкаяПромышленностьНабор</name>
  </enumValues>
  <enumValues>
    <name>ФотоаппаратыНабор</name>
  </enumValues>
  <enumValues>
    <name>АнтисептикиНабор</name>
  </enumValues>
  <enumValues>
    <name>МолочнаяПродукцияПодконтрольнаяВЕТИСНабор</name>
  </enumValues>
  <enumValues>
    <name>МолочнаяПродукцияБезВЕТИСНабор</name>
  </enumValues>
  <enumValues>
    <name>АнтисептикиГрупповаяУпаковка</name>
  </enumValues>
  <enumValues>
    <name>МолочнаяПродукцияПодконтрольнаяВЕТИСГрупповаяУпаковка</name>
  </enumValues>
  <enumValues>
    <name>МолочнаяПродукцияБезВЕТИСГрупповаяУпаковка</name>
  </enumValues>
  <enumValues>
    <name>ПивоГрупповаяУпаковка</name>
  </enumValues>
  <enumValues>
    <name>УпакованнаяВодаГрупповаяУпаковка</name>
  </enumValues>
</mdclass:Enum>

Управление_торговлей_демо/src/Enums/ВидыПродукцииИС/ВидыПродукцииИС.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:Enum>
  <name>ВидыПродукцииИС</name>
  <enumValues>
    <name>Алкогольная</name>
  </enumValues>
  <enumValues>
    <name>Табак</name>
  </enumValues>
  <enumValues>
    <name>Обувь</name>
  </enumValues>
  <enumValues>
    <name>ЛегкаяПромышленность</name>
  </enumValues>
  <enumValues>
    <name>МолочнаяПродукцияПодконтрольнаяВЕТИС</name>
  </enumValues>
  <enumValues>
    <name>Шины</name>
  </enumValues>
  <enumValues>
    <name>Фотоаппараты</name>
  </enumValues>
  <enumValues>
    <name>Духи</name>
  </enumValues>
  <enumValues>
    <name>Велосипеды</name>
  </enumValues>
  <enumValues>
    <name>КреслаКоляски</name>
  </enumValues>
  <enumValues>
    <name>АльтернативныйТабак</name>
  </enumValues>
  <enumValues>
    <name>УпакованнаяВода</name>
  </enumValues>
  <enumValues>
    <name>МолочнаяПродукцияБезВЕТИС</name>
  </enumValues>
  <enumValues>
    <name>Антисептики</name>
  </enumValues>
  <enumValues>
    <name>БАДы</name>
  </enumValues>
  <enumValues>
    <name>НикотиносодержащаяПродукция</name>
  </enumValues>
  <enumValues>
    <name>Пиво</name>
  </enumValues>
  <enumValues>
    <name>ПродукцияИзНатуральногоМеха</name>
  </enumValues>
</mdclass:Enum>

Управление_торговлей_демо/src/Enums/ВидыОперацийИСМП/ВидыОперацийИСМП.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:Enum>
  <name>ВидыОперацийИСМП</name>
  <enumValues>
    <name>Агрегация</name>
  </enumValues>
  <enumValues>
    <name>АгрегацияИзменение</name>
  </enumValues>
  <enumValues>
    <name>АгрегацияИзменениеРасчетСтатуса</name>
  </enumValues>
  <enumValues>
    <name>АгрегацияПроверкаСтатусаОбработкиДокумента</name>
  </enumValues>
  <enumValues>
    <name>АгрегацияРасчетСтатуса</name>
  </enumValues>
  <enumValues>
    <name>АгрегацияСоздание</name>
  </enumValues>
  <enumValues>
    <name>АгрегацияСозданиеНабора</name>
  </enumValues>
  <enumValues>
    <name>АгрегацияУдаление</name>
  </enumValues>
  <enumValues>
    <name>АТК</name>
  </enumValues>
  <enumValues>
    <name>АТКИзменение</name>
  </enumValues>
  <enumValues>
    <name>АТКСоздание</name>
  </enumValues>
  <enumValues>
    <name>АТКУдаление</name>
  </enumValues>
  <enumValues>
    <name>ВводВОборот</name>
  </enumValues>
  <enumValues>
    <name>ВводВОборотИмпортСФТС</name>
  </enumValues>
  <enumValues>
    <name>ВводВОборотИмпортСФТСМех</name>
  </enumValues>
  <enumValues>
    <name>ВводВОборотКонтрактноеПроизводствоЕАЭС</name>
  </enumValues>
  <enumValues>
    <name>ВводВОборотМаркировкаОстатков</name>
  </enumValues>
  <enumValues>
    <name>ВводВОборотПолучениеПродукцииОтФизическихЛиц</name>
  </enumValues>
  <enumValues>
    <name>ВводВОборотПроизводствоВнеЕАЭС</name>
  </enumValues>
  <enumValues>
    <name>ВводВОборотПроизводствоРФ</name>
  </enumValues>
  <enumValues>
    <name>ВводВОборотПроизводствоРФПоДоговору</name>
  </enumValues>
  <enumValues>
    <name>ВводВОборотПроизводствоРФПоДоговоруНаСторонеЗаказчика</name>
  </enumValues>
  <enumValues>
    <name>ВыводИзОборота</name>
  </enumValues>
  <enumValues>
    <name>ВыводИзОборотаБезвозмезднаяПередача</name>
  </enumValues>
  <enumValues>
    <name>ВыводИзОборотаБрак</name>
  </enumValues>
  <enumValues>
    <name>ВыводИзОборотаВозвратФизическомуЛицу</name>
  </enumValues>
  <enumValues>
    <name>ВыводИзОборотаВПроцессеРеализацииПоДоговоруРассрочки</name>
  </enumValues>
  <enumValues>
    <name>ВыводИзОборотаДругиеПричины</name>
  </enumValues>
  <enumValues>
    <name>ВыводИзОборотаДругое</name>
  </enumValues>
  <enumValues>
    <name>ВыводИзОборотаИспользованиеДляПроизводственныхЦелей</name>
  </enumValues>
  <enumValues>
    <name>ВыводИзОборотаИспользованиеДляСобственныхНуждПредприятия</name>
  </enumValues>
  <enumValues>
    <name>ВыводИзОборотаИстечениеСрокаГодности</name>
  </enumValues>
  <enumValues>
    <name>ВыводИзОборотаКонфискацияТовара</name>
  </enumValues>
  <enumValues>
    <name>ВыводИзОборотаКредитныйДоговор</name>
  </enumValues>
  <enumValues>
    <name>ВыводИзОборотаЛабораторныеОбразцы</name>
  </enumValues>
  <enumValues>
    <name>ВыводИзОборотаЛиквидацияПредприятия</name>
  </enumValues>
  <enumValues>
    <name>ВыводИзОборотаОтзывСРынка</name>
  </enumValues>
  <enumValues>
    <name>ВыводИзОборотаПродажаПоГосударственномуКонтракту</name>
  </enumValues>
  <enumValues>
    <name>ВыводИзОборотаПродажаПоОбразцамДистанционнаяПродажа</name>
  </enumValues>
  <enumValues>
    <name>ВыводИзОборотаПродажаПоСделкеСоставляющейГосударственнуюТайну</name>
  </enumValues>
  <enumValues>
    <name>ВыводИзОборотаПродажаЧерезВендинговыйАппарат</name>
  </enumValues>
  <enumValues>
    <name>ВыводИзОборотаРеализацияКонфискованныхТоваров</name>
  </enumValues>
  <enumValues>
    <name>ВыводИзОборотаРеализацияПоДоговоруРассрочки</name>
  </enumValues>
  <enumValues>
    <name>ВыводИзОборотаРекламации</name>
  </enumValues>
  <enumValues>
    <name>ВыводИзОборотаРозничнаяПродажа</name>
  </enumValues>
  <enumValues>
    <name>ВыводИзОборотаТестированиеПродукта</name>
  </enumValues>
  <enumValues>
    <name>ВыводИзОборотаУничтожениеТовара</name>
  </enumValues>
  <enumValues>
    <name>ВыводИзОборотаУтилизацияТовара</name>
  </enumValues>
  <enumValues>
    <name>ВыводИзОборотаУтратаПовреждениеТовара</name>
  </enumValues>
  <enumValues>
    <name>ВыводИзОборотаФасовка</name>
  </enumValues>
  <enumValues>
    <name>ВыводИзОборотаЭкспортВСтраныЕАЭС</name>
  </enumValues>
  <enumValues>
    <name>ВыводИзОборотаЭкспортЗаПределыСтранЕАЭС</name>
  </enumValues>
  <enumValues>
    <name>ЗагрузкаВходящихДокументов</name>
  </enumValues>
  <enumValues>
    <name>ЗаказНаЭмиссиюКодовМаркировки</name>
  </enumValues>
  <enumValues>
    <name>ЗаказНаЭмиссиюКодовМаркировкиЗапросGTINНаОстатки</name>
  </enumValues>
  <enumValues>
    <name>ЗаказНаЭмиссиюКодовМаркировкиРасчетСтатуса</name>
  </enumValues>
  <enumValues>
    <name>ЗакрытиеЗаказаНаЭмиссиюСУЗ</name>
  </enumValues>
  <enumValues>
    <name>ЗакрытиеПодзаказаНаЭмиссиюКодовМаркировкиСУЗ</name>
  </enumValues>
  <enumValues>
    <name>ЗапросИдентификатораСоединенияСУЗ</name>
  </enumValues>
  <enumValues>
    <name>ИндивидуализацияКИЗ</name>
  </enumValues>
  <enumValues>
    <name>ОтгрузкаВЕАЭСПриОСУ</name>
  </enumValues>
  <enumValues>
    <name>ОтгрузкаКомиссия</name>
  </enumValues>
  <enumValues>
    <name>ОтгрузкаПриобретениеГосПредприятием</name>
  </enumValues>
  <enumValues>
    <name>ОтгрузкаПродажа</name>
  </enumValues>
  <enumValues>
    <name>ОтгрузкаТрансграничнаяТорговля</name>
  </enumValues>
  <enumValues>
    <name>ОтгрузкаТрансграничнаяТорговляАннулирование</name>
  </enumValues>
  <enumValues>
    <name>ПовторноеФормированиеСообщений</name>
  </enumValues>
  <enumValues>
    <name>ОтчетОбИспользованииКодовМаркировки</name>
  </enumValues>
  <enumValues>
    <name>ОтчетОбИспользованииПроверкаСтатусаКодовМаркировки</name>
  </enumValues>
  <enumValues>
    <name>ОтчетОбИспользованииРасчетСтатуса</name>
  </enumValues>
  <enumValues>
    <name>ОтчетОВерификацииНанесенныхКМ</name>
  </enumValues>
  <enumValues>
    <name>Перемаркировка</name>
  </enumValues>
  <enumValues>
    <name>ПовторноеПолучениеКодовМаркировкиИзСУЗ</name>
  </enumValues>
  <enumValues>
    <name>ПодтверждениеПоступленияКИЗ</name>
  </enumValues>
  <enumValues>
    <name>ПодтверждениеПоступленияКИЗРасчетСтатуса</name>
  </enumValues>
  <enumValues>
    <name>ПолучениеКодовМаркировкиИзСУЗ</name>
  </enumValues>
  <enumValues>
    <name>ПолучениеРезультатаОбработкиДокумента</name>
  </enumValues>
  <enumValues>
    <name>ПолучениеРезультатаОбработкиЗаказаНаЭмиссиюКодовМаркировки</name>
  </enumValues>
  <enumValues>
    <name>ПолучениеСтатусаПулаКодовМаркировкиИзСУЗ</name>
  </enumValues>
  <enumValues>
    <name>Приемка</name>
  </enumValues>
  <enumValues>
    <name>ПриемкаАгент</name>
  </enumValues>
  <enumValues>
    <name>ПриемкаБезвозмезднаяПередача</name>
  </enumValues>
  <enumValues>
    <name>ПриемкаДляСобственныхНуждПокупателя</name>
  </enumValues>
  <enumValues>
    <name>ПриемкаИзЕАЭСПриОСУ</name>
  </enumValues>
  <enumValues>
    <name>ПриемкаИзЕАЭССПризнаниемКМ</name>
  </enumValues>
  <enumValues>
    <name>ПриемкаКомиссия</name>
  </enumValues>
  <enumValues>
    <name>ПриемкаОтклонен</name>
  </enumValues>
  <enumValues>
    <name>ПриемкаОтклонить</name>
  </enumValues>
  <enumValues>
    <name>ПриемкаПриобретениеГосПредприятием</name>
  </enumValues>
  <enumValues>
    <name>ПриемкаПродажа</name>
  </enumValues>
  <enumValues>
    <name>ПриемкаТрансграничнаяТорговля</name>
  </enumValues>
  <enumValues>
    <name>СогласиеОПредоставлениеИнформации</name>
  </enumValues>
  <enumValues>
    <name>СогласиеОПредоставлениеИнформацииПодписание</name>
  </enumValues>
  <enumValues>
    <name>СогласиеОПредоставлениеИнформацииПодписаниеАннулирования</name>
  </enumValues>
  <enumValues>
    <name>СписаниеВведенныхВОборотКодовМаркировки</name>
  </enumValues>
  <enumValues>
    <name>СписаниеПроверкаСтатусаОбработкиДокумента</name>
  </enumValues>
  <enumValues>
    <name>СписаниеЭмитированныхКодовМаркировки</name>
  </enumValues>
  <enumValues>
    <name>СписаниеЭмитированныхКодовМаркировкиПриПоступлении</name>
  </enumValues>
  <enumValues>
    <name>СписаниеЭмитированныхКодовМаркировкиРасчетСтатуса</name>
  </enumValues>
  <enumValues>
    <name>УдалитьОтчетОПередачеКМНаПринтер</name>
  </enumValues>
  <enumValues>
    <name>УдалитьОтчетОПередачеКМНаПроизводственнуюЛинию</name>
  </enumValues>
  <enumValues>
    <name>УдалитьОтчетОПечатиКМ</name>
  </enumValues>
  <enumValues>
    <name>УдалитьОтчетОПотереРаспечатанныхКМ</name>
  </enumValues>
  <enumValues>
    <name>ПолучениеКодовМаркировкиИзСУЗНезависимо</name>
  </enumValues>
  <enumValues>
    <name>ВводВОборотРасчетСтатуса</name>
  </enumValues>
  <enumValues>
    <name>ВводВОборотТрансграничнаяТорговля</name>
  </enumValues>
  <enumValues>
    <name>ВозвратВОборот</name>
  </enumValues>
  <enumValues>
    <name>ВозвратВОборотПриДистанционномСпособеПродажи</name>
  </enumValues>
  <enumValues>
    <name>ВозвратВОборотПриРозничнойРеализации</name>
  </enumValues>
  <enumValues>
    <name>ВозвратВОборотТовараВыведенногоДляПроизводственныхЦелей</name>
  </enumValues>
  <enumValues>
    <name>ВозвратВОборотТовараВыведенногоДляСобственныхНужд</name>
  </enumValues>
  <enumValues>
    <name>КвитанцияДокумента</name>
  </enumValues>
  <enumValues>
    <name>ОтгрузкаАгент</name>
  </enumValues>
  <enumValues>
    <name>ОтгрузкаАннулирование</name>
  </enumValues>
  <enumValues>
    <name>ОтгрузкаАннулировать</name>
  </enumValues>
  <enumValues>
    <name>ОтгрузкаБезвозмезднаяПередача</name>
  </enumValues>
  <enumValues>
    <name>ОтгрузкаДляСобственныхНуждПокупателя</name>
  </enumValues>
  <enumValues>
    <name>ОтгрузкаЕАЭССПризнаниемКИ</name>
  </enumValues>
</mdclass:Enum>

Управление_торговлей_демо/src/CommonModules/ИнтеграцияИСМПКлиентСервер/Module.bsl
#Область ПрограммныйИнтерфейс

Функция ИмяПодсистемы() Экспорт
	
	Возврат "ИСМП";
	
КонецФункции

Функция ПредставлениеПодсистемы() Экспорт
	
	Возврат "ИС МП";
	
КонецФункции

Функция ИмяКомандыПулКодовМаркировки(ИмяПодсистемы) Экспорт
	
	Возврат
		ИнтеграцияИСКлиентСервер.ОбщийПрефиксКомандыНавигационнойСсылки(ИмяПодсистемы)
		+ "ПерейтиВПулКодовМаркировки";
	
КонецФункции

Функция ЭтоКомандаНавигационнойСсылкиПулКодовМаркировки(ОписаниеКоманды) Экспорт
	
	Возврат ОписаниеКоманды[2] = "ПерейтиВПулКодовМаркировки";
	
КонецФункции

Функция ИмяКомандыОткрытьФормуСверкиКодовМаркировки(ИмяПодсистемы) Экспорт
	
	Возврат
		ИнтеграцияИСКлиентСервер.ОбщийПрефиксКомандыНавигационнойСсылки(ИмяПодсистемы)
		+ "ОткрытьФормуСверкиКодовМаркировки";
	
КонецФункции

Функция ЭтоКомандаНавигационнойСсылкиОткрытьФормуСверкиКодовМаркировки(ОписаниеКоманды) Экспорт
	
	Возврат ОписаниеКоманды[2] = "ОткрытьФормуСверкиКодовМаркировки";
	
КонецФункции

Процедура ЗаполнитьСоответствиеПолейДокументовОснований(Форма, СоответствиеПолей) Экспорт
	
	Если СтрНачинаетсяС(Форма.ИмяФормы, "Документ.ЗаказНаЭмиссиюКодовМаркировкиСУЗ") Тогда
		
		СоответствиеПолей.Вставить("ПеремаркировкаТоваровИСМП", Новый Соответствие);
		СоответствиеПолей["ПеремаркировкаТоваровИСМП"].Вставить("Организация", "Организация");
		
		СоответствиеПолей.Вставить("МаркировкаТоваровИСМП", Новый Соответствие);
		СоответствиеПолей["МаркировкаТоваровИСМП"].Вставить("Организация",   "Организация");
		
	КонецЕсли;
	
	ИнтеграцияИСМПКлиентСерверПереопределяемый.ЗаполнитьСоответствиеПолейДокументовОснований(Форма, СоответствиеПолей);
	
КонецПроцедуры

Функция ШаблонКодаМаркировкиПоВидуПродукции(ВидПродукции, РежимВключенияУпаковокИНаборов = 0) Экспорт
	
	СписокШаблонов = ШаблоныКодовПоВидуПродукции(ВидПродукции, РежимВключенияУпаковокИНаборов);
	
	Если СписокШаблонов.Количество() > 0 Тогда
		Возврат СписокШаблонов.Получить(0).Значение;
	КонецЕсли;
	
	Возврат Неопределено;
	
КонецФункции

// Возвращает все шаблоны групповых упаковок
//
// Возвращаемое значение:
//   Массив Из ПеречислениеСсылка.ШаблоныКодовМаркировкиСУЗ - шаблоны групповых упаковок
//
Функция ШаблоныГрупповыхУпаковок() Экспорт
	
	Результат = Новый Массив;
	Результат.Добавить(ПредопределенноеЗначение("Перечисление.ШаблоныКодовМаркировкиСУЗ.БлокТабачныхПачек"));
	Результат.Добавить(ПредопределенноеЗначение("Перечисление.ШаблоныКодовМаркировкиСУЗ.АльтернативныйТабакБлок"));
	Результат.Добавить(ПредопределенноеЗначение("Перечисление.ШаблоныКодовМаркировкиСУЗ.НикотиносодержащаяПродукцияБлок"));
	Результат.Добавить(ПредопределенноеЗначение("Перечисление.ШаблоныКодовМаркировкиСУЗ.АнтисептикиГрупповаяУпаковка"));
	Результат.Добавить(ПредопределенноеЗначение("Перечисление.ШаблоныКодовМаркировкиСУЗ.МолочнаяПродукцияПодконтрольнаяВЕТИСГрупповаяУпаковка"));
	Результат.Добавить(ПредопределенноеЗначение("Перечисление.ШаблоныКодовМаркировкиСУЗ.МолочнаяПродукцияБезВЕТИСГрупповаяУпаковка"));
	Результат.Добавить(ПредопределенноеЗначение("Перечисление.ШаблоныКодовМаркировкиСУЗ.ПивоГрупповаяУпаковка"));
	Результат.Добавить(ПредопределенноеЗначение("Перечисление.ШаблоныКодовМаркировкиСУЗ.УпакованнаяВодаГрупповаяУпаковка"));
	Возврат Результат;
	
КонецФункции

// Возвращает шаблоны кодов маркировки, которые могут находиться в составе групповой упаковки
//
// Возвращаемое значение:
//   Массив Из ПеречислениеСсылка.ШаблоныКодовМаркировкиСУЗ - шаблоны индивидуальных упаковок, входящих в состав групповых.
//
Функция ШаблоныИндивидуальныхУпаковокВСоставеГрупповых() Экспорт
	
	Результат = Новый Массив;
	Результат.Добавить(ПредопределенноеЗначение("Перечисление.ШаблоныКодовМаркировкиСУЗ.ТабачнаяПачка"));
	Результат.Добавить(ПредопределенноеЗначение("Перечисление.ШаблоныКодовМаркировкиСУЗ.АльтернативныйТабакПачка"));
	Результат.Добавить(ПредопределенноеЗначение("Перечисление.ШаблоныКодовМаркировкиСУЗ.АльтернативныйТабакПачкаGS1"));
	Результат.Добавить(ПредопределенноеЗначение("Перечисление.ШаблоныКодовМаркировкиСУЗ.НикотиносодержащаяПродукцияПачка"));
	Результат.Добавить(ПредопределенноеЗначение("Перечисление.ШаблоныКодовМаркировкиСУЗ.Антисептики"));
	Результат.Добавить(ПредопределенноеЗначение("Перечисление.ШаблоныКодовМаркировкиСУЗ.МолочнаяПродукцияСерия6СимволовВЕТИС"));
	Результат.Добавить(ПредопределенноеЗначение("Перечисление.ШаблоныКодовМаркировкиСУЗ.МолочнаяПродукцияСерия6СимволовБезВЕТИС"));
	Результат.Добавить(ПредопределенноеЗначение("Перечисление.ШаблоныКодовМаркировкиСУЗ.Пиво"));
	Результат.Добавить(ПредопределенноеЗначение("Перечисление.ШаблоныКодовМаркировкиСУЗ.УпакованнаяВода"));
	Возврат Результат;
	
КонецФункции

// Возвращает шаблоны кодов маркировки, являющихся наборами
//
// Возвращаемое значение:
//   Массив Из ПеречислениеСсылка.ШаблоныКодовМаркировкиСУЗ - шаблоны наборов
//
Функция ШаблоныНаборов() Экспорт
	
	Результат = Новый Массив;
	Результат.Добавить(ПредопределенноеЗначение("Перечисление.ШаблоныКодовМаркировкиСУЗ.ЛегкаяПромышленностьНабор"));
	Результат.Добавить(ПредопределенноеЗначение("Перечисление.ШаблоныКодовМаркировкиСУЗ.ДухиНабор"));
	Результат.Добавить(ПредопределенноеЗначение("Перечисление.ШаблоныКодовМаркировкиСУЗ.ФотоаппаратыНабор"));
	Результат.Добавить(ПредопределенноеЗначение("Перечисление.ШаблоныКодовМаркировкиСУЗ.АнтисептикиНабор"));
	Результат.Добавить(ПредопределенноеЗначение("Перечисление.ШаблоныКодовМаркировкиСУЗ.МолочнаяПродукцияПодконтрольнаяВЕТИСНабор"));
	Результат.Добавить(ПредопределенноеЗначение("Перечисление.ШаблоныКодовМаркировкиСУЗ.МолочнаяПродукцияБезВЕТИСНабор"));
	Результат.Добавить(ПредопределенноеЗначение("Перечисление.ШаблоныКодовМаркировкиСУЗ.НикотиносодержащаяПродукцияНабор"));
	Возврат Результат;
	
КонецФункции

// Возвращает шаблоны кодов маркировки, которые могут находиться в составе набора
//
// Возвращаемое значение:
//   Массив Из ПеречислениеСсылка.ШаблоныКодовМаркировкиСУЗ - шаблоны комплектующих набора
//
Функция ШаблоныКомплектующихНаборов() Экспорт
	
	Результат = Новый Массив;
	Результат.Добавить(ПредопределенноеЗначение("Перечисление.ШаблоныКодовМаркировкиСУЗ.ЛегкаяПромышленность"));
	Результат.Добавить(ПредопределенноеЗначение("Перечисление.ШаблоныКодовМаркировкиСУЗ.Духи"));
	Результат.Добавить(ПредопределенноеЗначение("Перечисление.ШаблоныКодовМаркировкиСУЗ.Фотоаппараты"));
	Результат.Добавить(ПредопределенноеЗначение("Перечисление.ШаблоныКодовМаркировкиСУЗ.Антисептики"));
	Результат.Добавить(ПредопределенноеЗначение("Перечисление.ШаблоныКодовМаркировкиСУЗ.МолочнаяПродукцияСерия6СимволовВЕТИС"));
	Результат.Добавить(ПредопределенноеЗначение("Перечисление.ШаблоныКодовМаркировкиСУЗ.МолочнаяПродукцияСерия6СимволовБезВЕТИС"));
	Результат.Добавить(ПредопределенноеЗначение("Перечисление.ШаблоныКодовМаркировкиСУЗ.НикотиносодержащаяПродукцияПачка"));
	Возврат Результат;
	
КонецФункции

// Возвращает доступные шаблоны по виду продукции с представлением.
// 
// Параметры:
// 	ВидПродукции                   - ПеречислениеСсылка.ВидыПродукцииИС - Вид продукции.
// 	РежимВключенияУпаковокИНаборов - Число - Режим включения шаблонов для групповых упаковок и наборов:
// 	 0 - включать только потребительские упаковки
// 	 1 - включать групповые упаковки и потребительские упаковки
// 	 2 - включать наборы и потребительские упаковки
// 	 3 - включать групповые упаковки, наборы и потребительские упаковки
// 	 4 - включать только групповые упаковки
// 	 5 - включать только наборы.
// Возвращаемое значение:
// 	СписокЗначений - Список значений с представлениями.
Функция ШаблоныКодовПоВидуПродукции(ВидПродукции, РежимВключенияУпаковокИНаборов = 1) Экспорт
	
	ВключатьИндивидуальныеУпаковки =
			РежимВключенияУпаковокИНаборов = 0
		Или РежимВключенияУпаковокИНаборов = 1
		Или РежимВключенияУпаковокИНаборов = 2
		Или РежимВключенияУпаковокИНаборов = 3;
		
	ВключатьГрупповыеУпаковки =
			РежимВключенияУпаковокИНаборов = 1
		Или РежимВключенияУпаковокИНаборов = 3
		Или РежимВключенияУпаковокИНаборов = 4;
	
	ВключатьНаборы =
			РежимВключенияУпаковокИНаборов = 2
		Или РежимВключенияУпаковокИНаборов = 3
		Или РежимВключенияУпаковокИНаборов = 5;
	
	СписокВыбора = Новый СписокЗначений();
	Если ВидПродукции = ПредопределенноеЗначение("Перечисление.ВидыПродукцииИС.Табак") Тогда
		Если ВключатьИндивидуальныеУпаковки Тогда
			СписокВыбора.Добавить(ПредопределенноеЗначение("Перечисление.ШаблоныКодовМаркировкиСУЗ.ТабачнаяПачка"));
		КонецЕсли;
		Если ВключатьГрупповыеУпаковки Тогда
			СписокВыбора.Добавить(ПредопределенноеЗначение("Перечисление.ШаблоныКодовМаркировкиСУЗ.БлокТабачныхПачек"));
		КонецЕсли;
	ИначеЕсли ВидПродукции = ПредопределенноеЗначение("Перечисление.ВидыПродукцииИС.Обувь") Тогда
		Если ВключатьИндивидуальныеУпаковки Тогда
			СписокВыбора.Добавить(ПредопределенноеЗначение("Перечисление.ШаблоныКодовМаркировкиСУЗ.Обувь"));
		КонецЕсли;
	ИначеЕсли ВидПродукции = ПредопределенноеЗначение("Перечисление.ВидыПродукцииИС.МолочнаяПродукцияПодконтрольнаяВЕТИС") Тогда
		Если ВключатьИндивидуальныеУпаковки Тогда
			СписокВыбора.Добавить(
			ПредопределенноеЗначение(
				"Перечисление.ШаблоныКодовМаркировкиСУЗ.МолочнаяПродукцияСерия6СимволовВЕТИС"));
		КонецЕсли;
		Если ВключатьГрупповыеУпаковки Тогда
			СписокВыбора.Добавить(
			ПредопределенноеЗначение(
				"Перечисление.ШаблоныКодовМаркировкиСУЗ.МолочнаяПродукцияПодконтрольнаяВЕТИСГрупповаяУпаковка"));
		КонецЕсли;
		Если ВключатьНаборы Тогда
			СписокВыбора.Добавить(
			ПредопределенноеЗначение(
				"Перечисление.ШаблоныКодовМаркировкиСУЗ.МолочнаяПродукцияПодконтрольнаяВЕТИСНабор"));
		КонецЕсли;
	ИначеЕсли ВидПродукции = ПредопределенноеЗначение("Перечисление.ВидыПродукцииИС.МолочнаяПродукцияБезВЕТИС") Тогда
		Если ВключатьИндивидуальныеУпаковки Тогда
			СписокВыбора.Добавить(ПредопределенноеЗначение("Перечисление.ШаблоныКодовМаркировкиСУЗ.МолочнаяПродукцияСерия6СимволовБезВЕТИС"));
		КонецЕсли;
		Если ВключатьГрупповыеУпаковки Тогда
			СписокВыбора.Добавить(
			ПредопределенноеЗначение(
				"Перечисление.ШаблоныКодовМаркировкиСУЗ.МолочнаяПродукцияБезВЕТИСГрупповаяУпаковка"));
		КонецЕсли;
		Если ВключатьНаборы Тогда
			СписокВыбора.Добавить(
			ПредопределенноеЗначение(
				"Перечисление.ШаблоныКодовМаркировкиСУЗ.МолочнаяПродукцияБезВЕТИСНабор"));
		КонецЕсли;
	ИначеЕсли ВидПродукции = ПредопределенноеЗначение("Перечисление.ВидыПродукцииИС.ЛегкаяПромышленность") Тогда
		Если ВключатьИндивидуальныеУпаковки Тогда
			СписокВыбора.Добавить(ПредопределенноеЗначение("Перечисление.ШаблоныКодовМаркировкиСУЗ.ЛегкаяПромышленность"));
			СписокВыбора.Добавить(ПредопределенноеЗначение("Перечисление.ШаблоныКодовМаркировкиСУЗ.ЛегкаяПромышленностьКомплект"));
		КонецЕсли;
		Если ВключатьНаборы Тогда
			СписокВыбора.Добавить(
					ПредопределенноеЗначение(
						"Перечисление.ШаблоныКодовМаркировкиСУЗ.ЛегкаяПромышленностьНабор"));
		КонецЕсли;
	ИначеЕсли ВидПродукции = ПредопределенноеЗначение("Перечисление.ВидыПродукцииИС.Шины") Тогда
		Если ВключатьИндивидуальныеУпаковки Тогда
			СписокВыбора.Добавить(ПредопределенноеЗначение("Перечисление.ШаблоныКодовМаркировкиСУЗ.Шины"));
		КонецЕсли;
	ИначеЕсли ВидПродукции = ПредопределенноеЗначение("Перечисление.ВидыПродукцииИС.Фотоаппараты") Тогда
		Если ВключатьИндивидуальныеУпаковки Тогда
			СписокВыбора.Добавить(ПредопределенноеЗначение("Перечисление.ШаблоныКодовМаркировкиСУЗ.Фотоаппараты"));
		КонецЕсли;
		Если ВключатьНаборы Тогда
			СписокВыбора.Добавить(
					ПредопределенноеЗначение(
						"Перечисление.ШаблоныКодовМаркировкиСУЗ.ФотоаппаратыНабор"));
		КонецЕсли;
	ИначеЕсли ВидПродукции = ПредопределенноеЗначение("Перечисление.ВидыПродукцииИС.Велосипеды") Тогда
		Если ВключатьИндивидуальныеУпаковки Тогда
			СписокВыбора.Добавить(ПредопределенноеЗначение("Перечисление.ШаблоныКодовМаркировкиСУЗ.Велосипеды"));
		КонецЕсли;
	ИначеЕсли ВидПродукции = ПредопределенноеЗначение("Перечисление.ВидыПродукцииИС.КреслаКоляски") Тогда
		Если ВключатьИндивидуальныеУпаковки Тогда
			СписокВыбора.Добавить(ПредопределенноеЗначение("Перечисление.ШаблоныКодовМаркировкиСУЗ.КреслаКоляски"));
		КонецЕсли;
	ИначеЕсли ВидПродукции = ПредопределенноеЗначение("Перечисление.ВидыПродукцииИС.Духи") Тогда
		Если ВключатьИндивидуальныеУпаковки Тогда
			СписокВыбора.Добавить(ПредопределенноеЗначение("Перечисление.ШаблоныКодовМаркировкиСУЗ.Духи"));
		КонецЕсли;
		Если ВключатьНаборы Тогда
			СписокВыбора.Добавить(
					ПредопределенноеЗначение(
						"Перечисление.ШаблоныКодовМаркировкиСУЗ.ДухиНабор"));
		КонецЕсли;
	ИначеЕсли ВидПродукции = ПредопределенноеЗначение("Перечисление.ВидыПродукцииИС.АльтернативныйТабак") Тогда
		Если ВключатьИндивидуальныеУпаковки Тогда
			СписокВыбора.Добавить(ПредопределенноеЗначение("Перечисление.ШаблоныКодовМаркировкиСУЗ.АльтернативныйТабакПачка"));
			СписокВыбора.Добавить(ПредопределенноеЗначение("Перечисление.ШаблоныКодовМаркировкиСУЗ.АльтернативныйТабакПачкаGS1"));
		КонецЕсли;
		Если ВключатьГрупповыеУпаковки Тогда
			СписокВыбора.Добавить(ПредопределенноеЗначение("Перечисление.ШаблоныКодовМаркировкиСУЗ.АльтернативныйТабакБлок"));
		КонецЕсли;
	ИначеЕсли ВидПродукции = ПредопределенноеЗначение("Перечисление.ВидыПродукцииИС.НикотиносодержащаяПродукция") Тогда
		Если ВключатьИндивидуальныеУпаковки Тогда
			СписокВыбора.Добавить(ПредопределенноеЗначение("Перечисление.ШаблоныКодовМаркировкиСУЗ.НикотиносодержащаяПродукцияПачка"));
		КонецЕсли;
		Если ВключатьГрупповыеУпаковки Тогда
			СписокВыбора.Добавить(ПредопределенноеЗначение("Перечисление.ШаблоныКодовМаркировкиСУЗ.НикотиносодержащаяПродукцияБлок"));
		КонецЕсли;
		Если ВключатьНаборы Тогда
			СписокВыбора.Добавить(
					ПредопределенноеЗначение(
						"Перечисление.ШаблоныКодовМаркировкиСУЗ.НикотиносодержащаяПродукцияНабор"));
		КонецЕсли;
	ИначеЕсли ВидПродукции = ПредопределенноеЗначение("Перечисление.ВидыПродукцииИС.УпакованнаяВода") Тогда
		Если ВключатьИндивидуальныеУпаковки Тогда
			СписокВыбора.Добавить(ПредопределенноеЗначение("Перечисление.ШаблоныКодовМаркировкиСУЗ.УпакованнаяВода"));
		КонецЕсли;
		Если ВключатьГрупповыеУпаковки Тогда
			СписокВыбора.Добавить(ПредопределенноеЗначение("Перечисление.ШаблоныКодовМаркировкиСУЗ.УпакованнаяВодаГрупповаяУпаковка"));
		КонецЕсли;
	ИначеЕсли ВидПродукции = ПредопределенноеЗначение("Перечисление.ВидыПродукцииИС.Антисептики") Тогда
		Если ВключатьИндивидуальныеУпаковки Тогда
			СписокВыбора.Добавить(ПредопределенноеЗначение("Перечисление.ШаблоныКодовМаркировкиСУЗ.Антисептики"));
		КонецЕсли;
		Если ВключатьГрупповыеУпаковки Тогда
			СписокВыбора.Добавить(ПредопределенноеЗначение("Перечисление.ШаблоныКодовМаркировкиСУЗ.АнтисептикиГрупповаяУпаковка"));
		КонецЕсли;
		Если ВключатьНаборы Тогда
			СписокВыбора.Добавить(ПредопределенноеЗначение("Перечисление.ШаблоныКодовМаркировкиСУЗ.АнтисептикиНабор"));
		КонецЕсли;
	ИначеЕсли ВидПродукции = ПредопределенноеЗначение("Перечисление.ВидыПродукцииИС.БАДы") Тогда
		Если ВключатьИндивидуальныеУпаковки Тогда
			СписокВыбора.Добавить(ПредопределенноеЗначение("Перечисление.ШаблоныКодовМаркировкиСУЗ.БАДы"));
		КонецЕсли;
	ИначеЕсли ВидПродукции = ПредопределенноеЗначение("Перечисление.ВидыПродукцииИС.Пиво") Тогда
		Если ВключатьИндивидуальныеУпаковки Тогда
			СписокВыбора.Добавить(ПредопределенноеЗначение("Перечисление.ШаблоныКодовМаркировкиСУЗ.Пиво"));
		КонецЕсли;
		Если ВключатьГрупповыеУпаковки Тогда
			СписокВыбора.Добавить(ПредопределенноеЗначение("Перечисление.ШаблоныКодовМаркировкиСУЗ.ПивоГрупповаяУпаковка"));
		КонецЕсли;
	ИначеЕсли ВидПродукции = ПредопределенноеЗначение("Перечисление.ВидыПродукцииИС.ПродукцияИзНатуральногоМеха") Тогда
		СписокВыбора.Добавить(ПредопределенноеЗначение("Перечисление.ШаблоныКодовМаркировкиСУЗ.ПродукцияИзНатуральногоМеха"));
	КонецЕсли;
	
	ПредставленияШаблонов = ПредставленияШаблоновКодаМаркировки();
	Для Каждого ЭлементСпискаЗначений Из СписокВыбора Цикл
		ЭлементПредставления = ПредставленияШаблонов.НайтиПоЗначению(ЭлементСпискаЗначений.Значение);
		Если ЭлементПредставления <> Неопределено Тогда
			ЭлементСпискаЗначений.Представление = ЭлементПредставления.Представление;
		КонецЕсли;
	КонецЦикла;
	
	Возврат СписокВыбора;
	
КонецФункции

Функция ШаблоныКодовПоНоменклатуре(Номенклатура, РежимВключенияУпаковокИНаборов = 1) Экспорт
	
	ВидПродукции = ИнтеграцияИСМПВызовСервера.ВидПродукцииПоНоменклатуре(Номенклатура);
	
	Возврат ШаблоныКодовПоВидуПродукции(ВидПродукции, РежимВключенияУпаковокИНаборов);
	
КонецФункции

Функция ДоступностьТрансграничнойТорговлиПоВидуПродукции(ВидМаркируемойПродукции) Экспорт
	
	Если ВидМаркируемойПродукции = ПредопределенноеЗначение("Перечисление.ВидыПродукцииИС.Обувь")
		Или ВидМаркируемойПродукции = ПредопределенноеЗначение("Перечисление.ВидыПродукцииИС.ЛегкаяПромышленность")
		Или ВидМаркируемойПродукции = ПредопределенноеЗначение("Перечисление.ВидыПродукцииИС.Духи")
		Или ВидМаркируемойПродукции = ПредопределенноеЗначение("Перечисление.ВидыПродукцииИС.Шины")
		Или ВидМаркируемойПродукции = ПредопределенноеЗначение("Перечисление.ВидыПродукцииИС.Фотоаппараты")
		Или ВидМаркируемойПродукции = ПредопределенноеЗначение("Перечисление.ВидыПродукцииИС.МолочнаяПродукцияПодконтрольнаяВЕТИС")
		Или ВидМаркируемойПродукции = ПредопределенноеЗначение("Перечисление.ВидыПродукцииИС.МолочнаяПродукцияБезВЕТИС") Тогда
		Возврат Истина;
	КонецЕсли;
	
	Возврат Ложь;
	
КонецФункции

Функция ПредставлениеGTINОстаткиПоВидуПродукции(Представление, ВидПродукции) Экспорт
	
	Если ЗначениеЗаполнено(Представление) Тогда
		Возврат Представление;
	КонецЕсли;
	
	МассивПредставления = Новый Массив();
	МассивПредставления.Добавить(НСтр("ru = 'Остатки'"));
	Если ЗначениеЗаполнено(ВидПродукции) Тогда
		МассивПредставления.Добавить(ВидПродукции);
	КонецЕсли;
	
	ПредставлениеНовое = СтрСоединить(МассивПредставления, ". ");
	
	Возврат ПредставлениеНовое;
	
КонецФункции

Функция ПредставлениеПустойНоменклатурыПоВидуПродукции(ВходныеДанные, ВидПродукции, Префикс = Неопределено) Экспорт
	
	Представление = "";
	
	Если ВидПродукции = ПредопределенноеЗначение("Перечисление.ВидыПродукцииИС.ПродукцияИзНатуральногоМеха") Тогда
		
		Поля = Новый Массив();
		Поля.Добавить("СпособВводаВОборот");
		Поля.Добавить("ВидКИЗ");
		Поля.Добавить("РазмерКИЗ");
		
		ИсходныеДанные = Новый Структура(СтрСоединить(Поля, ","));
		ЗаполнитьЗначенияСвойств(ИсходныеДанные, ВходныеДанные);
		
		ИтоговоеЗначение = Новый Массив();
		Если ЗначениеЗаполнено(Префикс) Тогда
			ИтоговоеЗначение.Добавить(Префикс);
		Иначе
			ИтоговоеЗначение.Добавить(НСтр("ru = 'КИЗ без индивидуализации'"));
		КонецЕсли;
		
		Для Каждого ИмяПоля Из Поля Цикл
			Если ЗначениеЗаполнено(ИсходныеДанные[ИмяПоля]) Тогда
				ИтоговоеЗначение.Добавить(ИсходныеДанные[ИмяПоля]);
			КонецЕсли;
		КонецЦикла;
		
		Представление = СтрСоединить(ИтоговоеЗначение, ", ");
		
	КонецЕсли;
	
	Возврат Представление;
	
КонецФункции

Функция ПредставлениеКИЗ() Экспорт
	
	Представление = НСтр("ru = 'КИЗ (без детальной информации)'");
	
	Возврат Представление;
	
КонецФункции

Функция КодТНВЭДПрочиеПредметыОдеждыИСМП() Экспорт
	
	Возврат "4303109080";
	
КонецФункции

Функция ПредставлениеВидаОперацииИСМП(Операция) Экспорт
	
	Если Операция = ПредопределенноеЗначение("Перечисление.ВидыОперацийИСМП.Агрегация") Тогда
		Возврат НСтр("ru = 'Агрегация'");
	ИначеЕсли Операция = ПредопределенноеЗначение("Перечисление.ВидыОперацийИСМП.ВводВОборотПроизводствоВнеЕАЭС") Тогда
		Возврат НСтр("ru = 'Импорт'");
	ИначеЕсли Операция = ПредопределенноеЗначение("Перечисление.ВидыОперацийИСМП.ВводВОборотИмпортСФТС") Тогда
		Возврат НСтр("ru = 'Импорт с ФТС'");
	ИначеЕсли Операция = ПредопределенноеЗначение("Перечисление.ВидыОперацийИСМП.ВводВОборотИмпортСФТСМех") Тогда
		Возврат НСтр("ru = 'Импорт с ФТС'");
	ИначеЕсли Операция = ПредопределенноеЗначение("Перечисление.ВидыОперацийИСМП.ВводВОборотПроизводствоРФ") Тогда
		Возврат НСтр("ru = 'Производство'");
	ИначеЕсли Операция = ПредопределенноеЗначение("Перечисление.ВидыОперацийИСМП.ВводВОборотКонтрактноеПроизводствоЕАЭС") Тогда
		Возврат НСтр("ru = 'Контрактное производство ЕАЭС'");
	ИначеЕсли Операция = ПредопределенноеЗначение("Перечисление.ВидыОперацийИСМП.ВводВОборотПроизводствоРФПоДоговору") Тогда
		Возврат НСтр("ru = 'Контрактное производство (от лица исполнителя)'");
	ИначеЕсли Операция = ПредопределенноеЗначение("Перечисление.ВидыОперацийИСМП.ВводВОборотПроизводствоРФПоДоговоруНаСторонеЗаказчика") Тогда
		Возврат НСтр("ru = 'Контрактное производство (от лица заказчика)'");
	ИначеЕсли Операция = ПредопределенноеЗначение("Перечисление.ВидыОперацийИСМП.ВводВОборотПолучениеПродукцииОтФизическихЛиц") Тогда
		Возврат НСтр("ru = 'Получение продукции от физических лиц'");
	ИначеЕсли Операция = ПредопределенноеЗначение("Перечисление.ВидыОперацийИСМП.ВводВОборотТрансграничнаяТорговля") Тогда
		Возврат НСтр("ru = 'Ввоз из ЕАЭС'");
	ИначеЕсли Операция = ПредопределенноеЗначение("Перечисление.ВидыОперацийИСМП.ВводВОборотМаркировкаОстатков") Тогда
		Возврат НСтр("ru = 'Маркировка остатков'");
	ИначеЕсли Операция = ПредопределенноеЗначение("Перечисление.ВидыОперацийИСМП.ИндивидуализацияКИЗ") Тогда
		Возврат НСтр("ru = 'Индивидуализация КИЗ'");
	ИначеЕсли Операция = ПредопределенноеЗначение("Перечисление.ВидыОперацийИСМП.ПодтверждениеПоступленияКИЗ") Тогда
		Возврат НСтр("ru = 'Подтверждение поступления КИЗ'");
	Иначе
		Возврат Строка(Операция);
	КонецЕсли;
	
КонецФункции

// Возвращает список операций нанесения.
// 
// Параметры:
//  ПолныйСписок - Булево - Истина, если нужен полный список операций, включая неиспользуемые.
//  ЭтоПродукцияИзНатуральногоМеха - Булево - доступные операции для вид продукции из натурального меха.
// Возвращаемое значение:
//  Массив из ПеречислениеСсылка.ВидыОперацийИСМП.
//
Функция ОперацииНанесенияКодовМаркировки(ПолныйСписок = Истина, ЭтоПродукцияИзНатуральногоМеха = Ложь) Экспорт
	
	Результат = Новый Массив;
	
	Если ПолныйСписок Тогда
		Результат.Добавить(ПредопределенноеЗначение("Перечисление.ВидыОперацийИСМП.ОтчетОВерификацииНанесенныхКМ"));
		Результат.Добавить(ПредопределенноеЗначение("Перечисление.ВидыОперацийИСМП.УдалитьОтчетОПечатиКМ"));
		Результат.Добавить(ПредопределенноеЗначение("Перечисление.ВидыОперацийИСМП.УдалитьОтчетОПередачеКМНаПринтер"));
		Результат.Добавить(ПредопределенноеЗначение("Перечисление.ВидыОперацийИСМП.УдалитьОтчетОПередачеКМНаПроизводственнуюЛинию"));
		Результат.Добавить(ПредопределенноеЗначение("Перечисление.ВидыОперацийИСМП.УдалитьОтчетОПотереРаспечатанныхКМ"));
		Результат.Добавить(ПредопределенноеЗначение("Перечисление.ВидыОперацийИСМП.ИндивидуализацияКИЗ"));
	ИначеЕсли ЭтоПродукцияИзНатуральногоМеха Тогда
		Результат.Добавить(ПредопределенноеЗначение("Перечисление.ВидыОперацийИСМП.ИндивидуализацияКИЗ"));
	Иначе
		Результат.Добавить(ПредопределенноеЗначение("Перечисление.ВидыОперацийИСМП.ОтчетОВерификацииНанесенныхКМ"));
	КонецЕсли;
	
	Возврат Результат;
	
КонецФункции

// Реализовать получение значения Признать определяемого типа ВариантДействийПоРасхождениямКодовМаркировкиИСМП.
//
// Возвращаемое значение:
//  ОпределяемыйТип.ВариантДействийПоРасхождениямКодовМаркировкиИСМП.
//
Функция ВариантДействийПоРасхождениямКодовМаркировкиИСМППризнать() Экспорт
	
	ВариантДействия = Неопределено;
	ИнтеграцияИСМПКлиентСерверПереопределяемый.ПриОпределенииВариантаДействийПоРасхождениямКодовМаркировкиИСМППризнать(ВариантДействия);
	Возврат ВариантДействия;
	
КонецФункции

// Реализовать получение значения Признать определяемого типа ВариантДействийПоРасхождениямКодовМаркировкиИСМП.
//
// Возвращаемое значение:
//  ОпределяемыйТип.ВариантДействийПоРасхождениямКодовМаркировкиИСМП.
//
Функция ВариантДействийПоРасхождениямКодовМаркировкиИСМПНеПризнать() Экспорт
	
	ВариантДействия = Неопределено;
	ИнтеграцияИСМПКлиентСерверПереопределяемый.ПриОпределенииВариантаДействийПоРасхождениямКодовМаркировкиИСМПНеПризнать(ВариантДействия);
	Возврат ВариантДействия;
	
КонецФункции

// Параметры формирования данных представления настройки номенклатуры.
// 
// Возвращаемое значение:
//  Структура                          - Параметры формирования данных представления настройки номенклатуры:
// * СсылкаНаОбъект                    - ОпределяемыйТип.Номенклатура       - Ссылка на номенклатуру, для которой выполняется настройка.
// * ВидПродукции                      - ПеречислениеСсылка.ВидыПродукцииИС - Вид продукции. Если не заполнено, то вид продукции получается по СсылкаНаОбъект.
// * ЕстьПравоРедактирования           - Булево  - Определяет наличие прав на редактирование, например, если есть права на справочник Номенклатура.
// * РазрешеноРедактированиеРеквизитов - Булево  - Истина (По-умолчанию), если пользователь принудительно включил редактирование реквизитов, например, через подсистему запрета редактирования реквизитов.
//                                                 Ложь - Библиотека определяет использование номенклатуры и разрешает редактирование, если в штрихкодах упаковок номенклатура не использовалась.
// * ТребуетВзвешивания                - Булево, Неопределено - Признак взвешивания потребительской упаковки.
//                                       Неопределено - Означает что в карточке товара нет информации о весовом товаре, необходимость взвешивания настривается в отдельной форме.
//                                       Истина       - Потребительская упаковка требует взвешивания.
//                                       Ложь         - Не требует взвешивания, настраиваются остальные параметры.
// * ДопустимаНастройкаЛогистическойЕдиницы - Булево - Включает возможность настройки потребительской упаковки как части единицы измерения номенклатуры.
// * ПредставлениеВНесколькоСтрок           - Булево - Переносит представление упаковки частичного выбытия на следующую строку. Используется, если место вывода гиперссылки в карточке номенклатуре менее ширины выводимого текста.
// * ОтступПриВыводеНастройкиВидаУпаковки   - Булево - Добавляет перенос строк при формировании гиперссылки настройки вида упаковки по GTIN.
Функция ПараметрыФормированияДанныхПредставленияНастройкиНоменклатуры() Экспорт
	
	ВозвращаемоеЗначение = Новый Структура();
	ВозвращаемоеЗначение.Вставить("СсылкаНаОбъект",                         Неопределено);
	ВозвращаемоеЗначение.Вставить("ВидПродукции",                           Неопределено);
	ВозвращаемоеЗначение.Вставить("ЕстьПравоРедактирования",                Истина);
	ВозвращаемоеЗначение.Вставить("РазрешеноРедактированиеРеквизитов",      Истина);
	ВозвращаемоеЗначение.Вставить("ТребуетВзвешивания",                     Неопределено);
	ВозвращаемоеЗначение.Вставить("ДопустимаНастройкаЛогистическойЕдиницы", Истина);
	ВозвращаемоеЗначение.Вставить("ПредставлениеВНесколькоСтрок",           Истина);
	ВозвращаемоеЗначение.Вставить("ОтступПриВыводеНастройкиВидаУпаковки",   Истина);
	
	Возврат ВозвращаемоеЗначение;
	
КонецФункции

#КонецОбласти

#Область СлужебныйПрограммныйИнтерфейс

Процедура УстановитьКартинкуСканированияКодаПоВидуПродукции(ЭлементФормыКартинка, ВидМаркируемойПродукции) Экспорт
	
	Если ВидМаркируемойПродукции = ПредопределенноеЗначение("Перечисление.ВидыПродукцииИС.Табак") Тогда
		КартинкаСканированияКода = БиблиотекаКартинок.СканированиеКодаМаркировкиТабакаИСМП;
	ИначеЕсли ВидМаркируемойПродукции = ПредопределенноеЗначение("Перечисление.ВидыПродукцииИС.МолочнаяПродукцияПодконтрольнаяВЕТИС") Тогда
		КартинкаСканированияКода = БиблиотекаКартинок.СканированиеКодаМаркировкиМолочнойПродукцииИСМП;
	ИначеЕсли ВидМаркируемойПродукции = ПредопределенноеЗначение("Перечисление.ВидыПродукцииИС.МолочнаяПродукцияБезВЕТИС") Тогда
		КартинкаСканированияКода = БиблиотекаКартинок.СканированиеКодаМаркировкиМолочнойПродукцииИСМП;
	ИначеЕсли ВидМаркируемойПродукции = ПредопределенноеЗначение("Перечисление.ВидыПродукцииИС.Шины") Тогда
		КартинкаСканированияКода = БиблиотекаКартинок.СканированиеКодаМаркировкиШинИСМП;
	ИначеЕсли ВидМаркируемойПродукции = ПредопределенноеЗначение("Перечисление.ВидыПродукцииИС.Фотоаппараты") Тогда
		КартинкаСканированияКода = БиблиотекаКартинок.СканированиеКодаМаркировкиФотоаппаратовИСМП;
	ИначеЕсли ВидМаркируемойПродукции = ПредопределенноеЗначение("Перечисление.ВидыПродукцииИС.Велосипеды") Тогда
		КартинкаСканированияКода = БиблиотекаКартинок.СканированиеКодаМаркировкиВелосипедовИСМП;
	ИначеЕсли ВидМаркируемойПродукции = ПредопределенноеЗначение("Перечисление.ВидыПродукцииИС.КреслаКоляски") Тогда
		КартинкаСканированияКода = БиблиотекаКартинок.СканированиеКодаМаркировкиКреслоКолясокИСМП;
	ИначеЕсли ВидМаркируемойПродукции = ПредопределенноеЗначение("Перечисление.ВидыПродукцииИС.Духи") Тогда
		КартинкаСканированияКода = БиблиотекаКартинок.СканированиеКодаМаркировкиДуховИСМП;
	ИначеЕсли ВидМаркируемойПродукции = ПредопределенноеЗначение("Перечисление.ВидыПродукцииИС.АльтернативныйТабак") Тогда
		КартинкаСканированияКода = БиблиотекаКартинок.СканированиеКодаМаркировкиАльтернативногоТабакаИСМП;
	ИначеЕсли ВидМаркируемойПродукции = ПредопределенноеЗначение("Перечисление.ВидыПродукцииИС.УпакованнаяВода") Тогда
		КартинкаСканированияКода = БиблиотекаКартинок.СканированиеКодаМаркировкиУпакованнойВодыИСМП;
	ИначеЕсли ВидМаркируемойПродукции = ПредопределенноеЗначение("Перечисление.ВидыПродукцииИС.Антисептики") Тогда
		КартинкаСканированияКода = БиблиотекаКартинок.СканированиеКодаМаркировкиАнтисептиковИСМП;
	ИначеЕсли ВидМаркируемойПродукции = ПредопределенноеЗначение("Перечисление.ВидыПродукцииИС.НикотиносодержащаяПродукция") Тогда
		КартинкаСканированияКода = БиблиотекаКартинок.СканированиеКодаМаркировкиНикотиносодержащейПродукцииИСМП;
	ИначеЕсли ВидМаркируемойПродукции = ПредопределенноеЗначение("Перечисление.ВидыПродукцииИС.Пиво") Тогда
		КартинкаСканированияКода = БиблиотекаКартинок.СканированиеКодаМаркировкиПиваИСМП;
	ИначеЕсли ВидМаркируемойПродукции = ПредопределенноеЗначение("Перечисление.ВидыПродукцииИС.БАДы") Тогда
		КартинкаСканированияКода = БиблиотекаКартинок.СканированиеКодаМаркировкиБАДовИСМП;
	ИначеЕсли ВидМаркируемойПродукции = ПредопределенноеЗначение("Перечисление.ВидыПродукцииИС.ПродукцияИзНатуральногоМеха") Тогда
		КартинкаСканированияКода = БиблиотекаКартинок.СканированиеКодаМаркировкиПродукцииИзНатуральногоМехаИСМП;
	Иначе
		КартинкаСканированияКода = БиблиотекаКартинок.СканированиеКодаМаркировкиИСМП;
	КонецЕсли;
	
	ЭлементФормыКартинка.Картинка = КартинкаСканированияКода; 
	
КонецПроцедуры

Функция ПредставленияШаблоновКодаМаркировки() Экспорт
	
	СписокВидовПродукции = Новый СписокЗначений();
	
	СписокВидовПродукции.Добавить(
		ПредопределенноеЗначение("Перечисление.ШаблоныКодовМаркировкиСУЗ.ТабачнаяПачка"),
		НСтр("ru = 'Пачка'"));
	СписокВидовПродукции.Добавить(
		ПредопределенноеЗначение("Перечисление.ШаблоныКодовМаркировкиСУЗ.БлокТабачныхПачек"),
		НСтр("ru = 'Блок'"));
	СписокВидовПродукции.Добавить(
		ПредопределенноеЗначение("Перечисление.ШаблоныКодовМаркировкиСУЗ.МолочнаяПродукцияБезУказанияСроковГодностиВЕТИС"),
		НСтр("ru = 'Без срока годности'"));
	СписокВидовПродукции.Добавить(
		ПредопределенноеЗначение("Перечисление.ШаблоныКодовМаркировкиСУЗ.МолочнаяПродукцияПодконтрольнаяВЕТИС"),
		НСтр("ru = 'Со сроком годности (до дней)'"));
	СписокВидовПродукции.Добавить(
		ПредопределенноеЗначение("Перечисление.ШаблоныКодовМаркировкиСУЗ.СкоропортящаясяМолочнаяПродукцияВЕТИС"),
		НСтр("ru = 'Со сроком годности (до часов)'"));
	СписокВидовПродукции.Добавить(
		ПредопределенноеЗначение("Перечисление.ШаблоныКодовМаркировкиСУЗ.МолочнаяПродукцияБезВЕТИС"),
		НСтр("ru = 'Единица товара'"));
	СписокВидовПродукции.Добавить(
		ПредопределенноеЗначение("Перечисление.ШаблоныКодовМаркировкиСУЗ.МолочнаяПродукцияСерия6СимволовБезВЕТИС"),
		НСтр("ru = 'Единица товара'"));
	СписокВидовПродукции.Добавить(
		ПредопределенноеЗначение("Перечисление.ШаблоныКодовМаркировкиСУЗ.МолочнаяПродукцияСерия6СимволовВЕТИС"),
		НСтр("ru = 'Единица товара'"));
	СписокВидовПродукции.Добавить(
		ПредопределенноеЗначение("Перечисление.ШаблоныКодовМаркировкиСУЗ.АльтернативныйТабакБлок"),
		НСтр("ru = 'Блок (GS1)'"));
	СписокВидовПродукции.Добавить(
		ПредопределенноеЗначение("Перечисление.ШаблоныКодовМаркировкиСУЗ.АльтернативныйТабакПачка"),
		НСтр("ru = 'Пачка (Классический табак)'"));
	СписокВидовПродукции.Добавить(
		ПредопределенноеЗначение("Перечисление.ШаблоныКодовМаркировкиСУЗ.АльтернативныйТабакПачкаGS1"),
		НСтр("ru = 'Пачка (GS1)'"));
	СписокВидовПродукции.Добавить(
		ПредопределенноеЗначение("Перечисление.ШаблоныКодовМаркировкиСУЗ.НикотиносодержащаяПродукцияПачка"),
		НСтр("ru = 'Пачка'"));
	СписокВидовПродукции.Добавить(
		ПредопределенноеЗначение("Перечисление.ШаблоныКодовМаркировкиСУЗ.НикотиносодержащаяПродукцияБлок"),
		НСтр("ru = 'Блок'"));
	
	СписокВидовПродукции.Добавить(
		ПредопределенноеЗначение("Перечисление.ШаблоныКодовМаркировкиСУЗ.ЛегкаяПромышленность"),
		НСтр("ru = 'Единица товара'"));
		
	СписокВидовПродукции.Добавить(
		ПредопределенноеЗначение("Перечисление.ШаблоныКодовМаркировкиСУЗ.Фотоаппараты"),
		НСтр("ru = 'Единица товара'"));
		
	СписокВидовПродукции.Добавить(
		ПредопределенноеЗначение("Перечисление.ШаблоныКодовМаркировкиСУЗ.Духи"),
		НСтр("ru = 'Единица товара'"));
		
	СписокВидовПродукции.Добавить(
		ПредопределенноеЗначение("Перечисление.ШаблоныКодовМаркировкиСУЗ.Антисептики"),
		НСтр("ru = 'Единица товара'"));
		
	СписокВидовПродукции.Добавить(
		ПредопределенноеЗначение("Перечисление.ШаблоныКодовМаркировкиСУЗ.Пиво"),
		НСтр("ru = 'Единица товара'"));
		
	СписокВидовПродукции.Добавить(
		ПредопределенноеЗначение("Перечисление.ШаблоныКодовМаркировкиСУЗ.УпакованнаяВода"),
		НСтр("ru = 'Единица товара'"));
		
	СписокВидовПродукции.Добавить(
		ПредопределенноеЗначение("Перечисление.ШаблоныКодовМаркировкиСУЗ.ДухиКомплект"),
		НСтр("ru = 'Комплект'"));
		
	СписокВидовПродукции.Добавить(
		ПредопределенноеЗначение("Перечисление.ШаблоныКодовМаркировкиСУЗ.ЛегкаяПромышленностьКомплект"),
		НСтр("ru = 'Комплект'"));
		
	СписокВидовПродукции.Добавить(
		ПредопределенноеЗначение("Перечисление.ШаблоныКодовМаркировкиСУЗ.ФотоаппаратыКомплект"),
		НСтр("ru = 'Комплект'"));
	
	СписокВидовПродукции.Добавить(
		ПредопределенноеЗначение("Перечисление.ШаблоныКодовМаркировкиСУЗ.ПродукцияИзНатуральногоМеха"),
		НСтр("ru = 'Единица товара'"));
	
	СписокВидовПродукции.Добавить(
		ПредопределенноеЗначение("Перечисление.ШаблоныКодовМаркировкиСУЗ.ДухиНабор"),
		НСтр("ru = 'Набор'"));
		
	СписокВидовПродукции.Добавить(
		ПредопределенноеЗначение("Перечисление.ШаблоныКодовМаркировкиСУЗ.ЛегкаяПромышленностьНабор"),
		НСтр("ru = 'Набор'"));
		
	СписокВидовПродукции.Добавить(
		ПредопределенноеЗначение("Перечисление.ШаблоныКодовМаркировкиСУЗ.ФотоаппаратыНабор"),
		НСтр("ru = 'Набор'"));
		
	СписокВидовПродукции.Добавить(
		ПредопределенноеЗначение("Перечисление.ШаблоныКодовМаркировкиСУЗ.АнтисептикиНабор"),
		НСтр("ru = 'Набор'"));
		
	СписокВидовПродукции.Добавить(
		ПредопределенноеЗначение("Перечисление.ШаблоныКодовМаркировкиСУЗ.МолочнаяПродукцияПодконтрольнаяВЕТИСНабор"),
		НСтр("ru = 'Набор'"));
		
	СписокВидовПродукции.Добавить(
		ПредопределенноеЗначение("Перечисление.ШаблоныКодовМаркировкиСУЗ.МолочнаяПродукцияБезВЕТИСНабор"),
		НСтр("ru = 'Набор'"));
		
	СписокВидовПродукции.Добавить(
		ПредопределенноеЗначение("Перечисление.ШаблоныКодовМаркировкиСУЗ.НикотиносодержащаяПродукцияНабор"),
		НСтр("ru = 'Набор'"));
		
	СписокВидовПродукции.Добавить(
		ПредопределенноеЗначение("Перечисление.ШаблоныКодовМаркировкиСУЗ.АнтисептикиГрупповаяУпаковка"),
		НСтр("ru = 'Групповая упаковка'"));
		
	СписокВидовПродукции.Добавить(
		ПредопределенноеЗначение("Перечисление.ШаблоныКодовМаркировкиСУЗ.ПивоГрупповаяУпаковка"),
		НСтр("ru = 'Групповая упаковка'"));
		
	СписокВидовПродукции.Добавить(
		ПредопределенноеЗначение("Перечисление.ШаблоныКодовМаркировкиСУЗ.МолочнаяПродукцияПодконтрольнаяВЕТИСГрупповаяУпаковка"),
		НСтр("ru = 'Групповая упаковка'"));
		
	СписокВидовПродукции.Добавить(
		ПредопределенноеЗначение("Перечисление.ШаблоныКодовМаркировкиСУЗ.МолочнаяПродукцияБезВЕТИСГрупповаяУпаковка"),
		НСтр("ru = 'Групповая упаковка'"));
		
	СписокВидовПродукции.Добавить(
		ПредопределенноеЗначение("Перечисление.ШаблоныКодовМаркировкиСУЗ.УпакованнаяВодаГрупповаяУпаковка"),
		НСтр("ru = 'Групповая упаковка'"));
		
	Возврат СписокВидовПродукции;
	
КонецФункции

Функция ИспользуетсяТипОплатыКодовМаркировки(ВидПродукции, Организация) Экспорт
	
	Если ВидПродукции = ПредопределенноеЗначение("Перечисление.ВидыПродукцииИС.УпакованнаяВода") Тогда
		Результат = Истина;
	ИначеЕсли ВидПродукции = ПредопределенноеЗначение("Перечисление.ВидыПродукцииИС.МолочнаяПродукцияБезВЕТИС")
		Или ВидПродукции = ПредопределенноеЗначение("Перечисление.ВидыПродукцииИС.МолочнаяПродукцияПодконтрольнаяВЕТИС") Тогда
		Результат = Не ИнтеграцияИСМПВызовСервера.ОрганизацияЯвляетсяФермером(Организация);
	Иначе
		Результат = Ложь;
	КонецЕсли;
	
	Возврат Результат;
	
КонецФункции

#Область ЗаполнениеСтруктур

Функция РеквизитыСозданияКонтрагента() Экспорт
	
	ДанныеКонтрагента = Новый Структура;
	ДанныеКонтрагента.Вставить("Наименование");
	ДанныеКонтрагента.Вставить("НаименованиеПолное");
	ДанныеКонтрагента.Вставить("ИНН");
	ДанныеКонтрагента.Вставить("КПП");
	ДанныеКонтрагента.Вставить("ЮридическийАдрес");
	ДанныеКонтрагента.Вставить("РегистрационныйНомер");
	Возврат ДанныеКонтрагента;
	
КонецФункции

Функция ИнициализироватьСтруктуруПодбораКодаТНВЭД() Экспорт
	
	ДанныеКодТНВЭД = Новый Структура;
	ДанныеКодТНВЭД.Вставить("Организация", Неопределено);
	ДанныеКодТНВЭД.Вставить("ВидПродукции", Неопределено);
	ДанныеКодТНВЭД.Вставить("КодТНВЭД", Неопределено);
	ДанныеКодТНВЭД.Вставить("ВозвращатьСсылкуНаЭлементКлассификатора", Ложь);
	Возврат ДанныеКодТНВЭД;
	
КонецФункции

#КонецОбласти

#Область ПервичныйДокумент

//Возвращает представление первичного документа собранное из составных частей
//
//Параметры:
//   Реквизиты - Структура - информация о первичном документе:
//   * Оплачен - Булево - оплачен
//   * ВидПервичногоДокумента - ПеречислениеСсылка.ВидыПервичныхДокументовИСМП - вид документа
//   * НаименованиеПервичногоДокумента - Строка - наименование документа
//   * НомерПервичногоДокумента - Строка - номер документа
//   * ДатаПервичногоДокумента - Дата - дата документа
//
//Возвращаемое значение:
//   Строка - представление первичного документа
//
Функция ПредставлениеПервичногоДокумента(Реквизиты) Экспорт
	
	Если Не ЗначениеЗаполнено(Реквизиты.ВидПервичногоДокумента) Тогда
		Возврат "";
	КонецЕсли;
	
	ЧастиИмени = Новый Массив;
	
	Если Реквизиты.ВидПервичногоДокумента = ПредопределенноеЗначение("Перечисление.ВидыПервичныхДокументовИСМП.АктУничтожения") Тогда
		ЧастиИмени.Добавить(НСтр("ru = 'Акт уничтожения'"));
	ИначеЕсли Реквизиты.ВидПервичногоДокумента = ПредопределенноеЗначение("Перечисление.ВидыПервичныхДокументовИСМП.КассовыйЧек") Тогда
		ЧастиИмени.Добавить(НСтр("ru = 'Чек'"));
	ИначеЕсли Реквизиты.ВидПервичногоДокумента = ПредопределенноеЗначение("Перечисление.ВидыПервичныхДокументовИСМП.ТаможеннаяДекларация") Тогда
		ЧастиИмени.Добавить(НСтр("ru = 'ГТД'"));
	ИначеЕсли Реквизиты.ВидПервичногоДокумента = ПредопределенноеЗначение("Перечисление.ВидыПервичныхДокументовИСМП.ТоварнаяНакладная") Тогда
		ЧастиИмени.Добавить(НСтр("ru = 'Товарная накладная'"));
	ИначеЕсли Реквизиты.ВидПервичногоДокумента = ПредопределенноеЗначение("Перечисление.ВидыПервичныхДокументовИСМП.ТоварныйЧек") Тогда
		ЧастиИмени.Добавить(НСтр("ru = 'Товарный чек'"));
	ИначеЕсли Реквизиты.ВидПервичногоДокумента = ПредопределенноеЗначение("Перечисление.ВидыПервичныхДокументовИСМП.УПД") Тогда
		ЧастиИмени.Добавить(НСтр("ru = 'УПД'"));
	ИначеЕсли Реквизиты.ВидПервичногоДокумента = ПредопределенноеЗначение("Перечисление.ВидыПервичныхДокументовИСМП.Прочее") Тогда
		ЧастиИмени.Добавить(Реквизиты.НаименованиеПервичногоДокумента);
	КонецЕсли;
	ЧастиИмени.Добавить(СтрШаблон(НСтр("ru = '№ %1'"), Реквизиты.НомерПервичногоДокумента));
	ЧастиИмени.Добавить(СтрШаблон(НСтр("ru = 'от %1'"), Формат(Реквизиты.ДатаПервичногоДокумента,"ДЛФ=D;")));
	Если ОбщегоНазначенияКлиентСервер.ЕстьРеквизитИлиСвойствоОбъекта(Реквизиты, "Оплачен")
		И Реквизиты.Оплачен Тогда
		ЧастиИмени.Добавить(НСтр("ru = '(оплачен)'"));
	КонецЕсли;
	Возврат СтрСоединить(ЧастиИмени, " ");
	
КонецФункции

Функция СоответствиеПричинПеремаркировкиПервичногоДокумента(Причина1, Причина2) Экспорт
	
	Возврат Причина1 = Причина2
	Или (Причина1 = ПредопределенноеЗначение("Перечисление.ПричиныПеремаркировкиТоваровИСМП.ВозвратОтРозничногоПокупателя")
		И Причина2 = ПредопределенноеЗначение("Перечисление.ПричиныПеремаркировкиТоваровИСМП.ВозвратВСлучаеДистанционнойПродажи"))
	Или (Причина2 = ПредопределенноеЗначение("Перечисление.ПричиныПеремаркировкиТоваровИСМП.ВозвратОтРозничногоПокупателя")
		И Причина1 = ПредопределенноеЗначение("Перечисление.ПричиныПеремаркировкиТоваровИСМП.ВозвратВСлучаеДистанционнойПродажи"))
	Или (Причина1 = ПредопределенноеЗначение("Перечисление.ПричиныПеремаркировкиТоваровИСМП.ВозвратОтЮридическогоЛица")
		И Причина2 = ПредопределенноеЗначение("Перечисление.ПричиныПеремаркировкиТоваровИСМП.ВозвратИзЕАЭС"))
	Или (Причина2 = ПредопределенноеЗначение("Перечисление.ПричиныПеремаркировкиТоваровИСМП.ВозвратОтЮридическогоЛица")
		И Причина1 = ПредопределенноеЗначение("Перечисление.ПричиныПеремаркировкиТоваровИСМП.ВозвратИзЕАЭС"));
	
КонецФункции

Функция ПолучитьНеДоступныеПричиныПеремаркировкиДляПервичногоДокумента() Экспорт
	
	Результат = Новый Массив;
	Результат.Добавить(ПредопределенноеЗначение("Перечисление.ПричиныПеремаркировкиТоваровИСМП.ПустаяСсылка"));
	Результат.Добавить(ПредопределенноеЗначение("Перечисление.ПричиныПеремаркировкиТоваровИСМП.ОшибкиОписанияТовара"));
	Результат.Добавить(ПредопределенноеЗначение("Перечисление.ПричиныПеремаркировкиТоваровИСМП.ИспорченоУтрачено"));
	Результат.Добавить(ПредопределенноеЗначение("Перечисление.ПричиныПеремаркировкиТоваровИСМП.РеализацияТоваровПриобретенныхНеДляПродажи"));
	
	Возврат Результат;
	
КонецФункции

Функция ПричинаПеремаркировкиДоступнаДляПервичногоДокумента(ПричинаПеремаркировки) Экспорт
	
	Возврат ПолучитьНеДоступныеПричиныПеремаркировкиДляПервичногоДокумента().Найти(ПричинаПеремаркировки) = Неопределено;
	
КонецФункции

Функция ПолучитьДоступныеВидыПервичныхДокументовДляПричиныПеремаркировки(ПричинаПеремаркировки) Экспорт
	
	ДоступныеВидыПервичныхДокументов = Новый СписокЗначений;
	Если ПричинаПеремаркировки = ПредопределенноеЗначение("Перечисление.ПричиныПеремаркировкиТоваровИСМП.ВозвратОтРозничногоПокупателя")
		Или ПричинаПеремаркировки = ПредопределенноеЗначение("Перечисление.ПричиныПеремаркировкиТоваровИСМП.ВозвратВСлучаеДистанционнойПродажи")
		Тогда
		
		ДоступныеВидыПервичныхДокументов.Добавить(ПредопределенноеЗначение("Перечисление.ВидыПервичныхДокументовИСМП.КассовыйЧек"));
		ДоступныеВидыПервичныхДокументов.Добавить(ПредопределенноеЗначение("Перечисление.ВидыПервичныхДокументовИСМП.ТоварныйЧек"));
		
	ИначеЕсли ПричинаПеремаркировки = ПредопределенноеЗначение("Перечисление.ПричиныПеремаркировкиТоваровИСМП.ВозвратОтЮридическогоЛица")
		Или ПричинаПеремаркировки = ПредопределенноеЗначение("Перечисление.ПричиныПеремаркировкиТоваровИСМП.ВозвратИзЕАЭС")
		Тогда
		
		ДоступныеВидыПервичныхДокументов.Добавить(ПредопределенноеЗначение("Перечисление.ВидыПервичныхДокументовИСМП.ТоварнаяНакладная"));
		ДоступныеВидыПервичныхДокументов.Добавить(ПредопределенноеЗначение("Перечисление.ВидыПервичныхДокументовИСМП.УПД"));
		
	Иначе
		Возврат ДоступныеВидыПервичныхДокументов;
	КонецЕсли;
	
	ДоступныеВидыПервичныхДокументов.Добавить(ПредопределенноеЗначение("Перечисление.ВидыПервичныхДокументовИСМП.Прочее"));
	
	Возврат ДоступныеВидыПервичныхДокументов;
	
КонецФункции

#КонецОбласти

Функция ПреобразоватьИдентификаторВСД(ИдентификаторПроисхожденияВЕТИССтрокой) Экспорт
	
	Если СтрДлина(ИдентификаторПроисхожденияВЕТИССтрокой) = 39 Тогда
		
		ИдентификаторПроисхожденияВЕТИССтрокой = НРег(ИдентификаторПроисхожденияВЕТИССтрокой);
		ИдентификаторПроисхожденияВЕТИССтрокой = СтрЗаменить(ИдентификаторПроисхожденияВЕТИССтрокой, "-", "");
		ИдентификаторПроисхожденияВЕТИССтрокой = Лев(ИдентификаторПроисхожденияВЕТИССтрокой,8)
			+ "-" + Сред(ИдентификаторПроисхожденияВЕТИССтрокой, 9, 4)
			+ "-" + Сред(ИдентификаторПроисхожденияВЕТИССтрокой, 13, 4)
			+ "-" + Сред(ИдентификаторПроисхожденияВЕТИССтрокой, 17, 4)
			+ "-" + Сред(ИдентификаторПроисхожденияВЕТИССтрокой, 21, 12);
		
		Возврат ИдентификаторПроисхожденияВЕТИССтрокой;
		
	Иначе
		Возврат ИдентификаторПроисхожденияВЕТИССтрокой;
	КонецЕсли;
	
КонецФункции

#КонецОбласти
